src/resources/apps/fr/alfresco/alfresco-model.xml

<!--
    Copyright (C) 2008 Etat de Vaud - CSI

    This program is free software; you can redistribute it and/or modify it under the terms of the
    GNU Lesser General Public License as published by the Free Software Foundation; either version
    2.1 of the License, or (at your option) any later version.

    This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
    without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
    See the GNU Lesser General Public License for more details.

    The full text of the license is available at http://www.gnu.org/copyleft/lesser.html

    ALTERNATIVELY, you may redistribute this software under the GPL/CSI license:

    http://www.vd.ch/fileadmin/user_upload/organisation/dinf/dsi/fichiers_pdf/GPL-de-la-CSI-2-0.pdf

-->
<!--
    This XForms model implements the interface to Alfresco through the Web Services API.
-->
<xforms:model id="fr-alfresco-model"
        xmlns:xforms="http://www.w3.org/2002/xforms"
        xmlns:xxforms="http://orbeon.org/oxf/xml/xforms"
        xmlns:exforms="http://www.exforms.org/exf/1-0"
        xmlns:ev="http://www.w3.org/2001/xml-events"
        xmlns:xi="http://www.w3.org/2001/XInclude"
        xmlns:xxi="http://orbeon.org/oxf/xml/xinclude"
        xmlns:xs="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:fr="http://orbeon.org/oxf/xml/form-runner"
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:alf-auth="http://www.alfresco.org/ws/service/authentication/1.0"
        xmlns:alf-content="http://www.alfresco.org/ws/service/content/1.0"
        xmlns:alf-cml="http://www.alfresco.org/ws/cml/1.0"
        xmlns:secext="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
        xmlns:utility="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">

    <!-- Global parameters -->
    <xxforms:variable name="parameters" select="xxforms:instance('fr-parameters-instance')" as="element()"/>
    <xxforms:variable name="app" select="$parameters/app" as="xs:string"/>
    <xxforms:variable name="form" select="$parameters/form" as="xs:string"/>

    <!-- Connection parameters depending on app/form -->
    <xxforms:variable name="alfresco-uri" select="xxforms:property(string-join(('oxf.fr.alfresco.uri', $app, $form), '.'))" as="xs:anyURI"/>
    <xxforms:variable name="alfresco-username" select="xxforms:property(string-join(('oxf.fr.alfresco.username', $app, $form), '.'))" as="xs:string"/>
    <xxforms:variable name="alfresco-credentials" select="xxforms:property(string-join(('oxf.fr.alfresco.credentials', $app, $form), '.'))" as="xs:string"/>
    <!-- Make sure to encode path using ISO 9075-14:2003 -->
    <xxforms:variable name="alfresco-path"
    	select="string-join(for $p in tokenize(xxforms:property(string-join(('oxf.fr.alfresco.path', $app, $form), '.')), '/')
    				return xxforms:encode-iso9075-14($p), '/')" as="xs:string"/>

    <!-- ===== Public interface ==================================================================================== -->

    <xforms:action ev:event="alfresco-send-document">
        <!-- Set properties provided by the user -->
        <xforms:setvalue ref="instance('alfresco-create-ws-request')//alf-cml:property[1]/alf-cml:value" value="event('fr:name')"/>
        <xforms:setvalue ref="instance('alfresco-create-ws-request')//alf-cml:property[2]/alf-cml:value" value="event('fr:title')"/>
        <xforms:setvalue ref="instance('alfresco-create-ws-request')//alf-cml:property[3]/alf-cml:value" value="event('fr:description')"/>

        <!-- Set encoded child node name based on name -->
        <xforms:setvalue ref="instance('alfresco-create-ws-request')//alf-cml:parent/alf-cml:childName"
                         value="concat('{http://www.alfresco.org/model/content/1.0}', xxforms:encode-iso9075-14(event('fr:name')))"/>

        <!-- Set content and type -->
        <xforms:setvalue ref="instance('alfresco-post-content-ws-request')//alf-content:content" value="event('fr:content')"/>
        <xforms:setvalue ref="instance('alfresco-post-content-ws-request')//alf-content:format/alf-content:mimetype" value="event('fr:mimetype')"/>

        <!-- Clear error -->
        <xforms:setvalue ref="instance('alfresco-error')/got-error" value="false()"/>

        <!-- 1. Authenticate -->
        <xforms:send submission="alfresco-auth-submission"/>
        <!-- 2. Create new document -->
        <xforms:send if="instance('alfresco-error')/got-error = 'false'" submission="alfresco-create-submission"/>
        <!-- 3. Upload document -->
        <xforms:action if="instance('alfresco-error')/got-error = 'false'">
            <!-- Propagate UUID -->
            <xforms:setvalue ref="instance('alfresco-post-content-ws-request')//alf-content:uuid" value="instance('alfresco-create-ws-response')//*[local-name() = 'uuid']"/>
            <!-- Upload content -->
            <xforms:send submission="alfresco-post-content-submission"/>
        </xforms:action>
        <!-- Display success message if ok -->
        <!--<xforms:action if="instance('alfresco-error')/got-error = 'false'">-->
            <!--<xforms:message>Document envoyé avec succès.</xforms:message>-->
        <!--</xforms:action>-->
        <!-- Display error if any -->
        <!--<xforms:action if="instance('alfresco-error')/got-error = 'true'">-->
            <!--<xforms:message>-->
                <!--Alfresco error: <xforms:output value="instance('alfresco-error')/message"/>-->
            <!--</xforms:message>-->
        <!--</xforms:action>-->
    </xforms:action>

    <!-- React to failed submission -->
    <xforms:action ev:event="xforms-submit-error">
        <!-- Remember any submission error -->
        <xforms:setvalue ref="instance('alfresco-error')/got-error" value="true()"/>
        <!--<xforms:setvalue ref="instance('alfresco-error')/message" value="event('body')"/>-->
        <!-- Notify persistence model -->
        <xforms:dispatch name="fr-submit-error" targetid="fr-persistence-model">
            <xxforms:context name="submission-id" select="event('xxforms:targetid')"/>
            <xxforms:context name="response-body" select="event('response-body')"/>
            <xxforms:context name="error-type" select="event('error-type')"/>
        </xforms:dispatch>
    </xforms:action>

    <xforms:instance id="alfresco-error">
        <error xmlns="">
            <got-error>false</got-error>
            <!--<message/>-->
        </error>
    </xforms:instance>

    <!-- ===== Authentication ====================================================================================== -->

    <!-- Authentication service -->
    <xforms:instance id="alfresco-auth-ws-request">
        <soap:Envelope>
            <soap:Body>
                <startSession xmlns="http://www.alfresco.org/ws/service/authentication/1.0">
                    <!-- This is filled-out when the instance is submitted -->
                    <username/>
                    <password/>
                </startSession>
            </soap:Body>
        </soap:Envelope>
    </xforms:instance>

    <xforms:instance id="alfresco-auth-ws-response">
        <soap:Envelope/>
        <!-- Example response -->
        <!--
        <soap:Envelope>
            <soap:Body>
                <startSessionResponse xmlns="http://www.alfresco.org/ws/service/authentication/1.0">
                    <startSessionReturn>
                        <username>admin</username>
                        <ticket>TICKET_286c8a49310f176109b53d8889d43a810b002a89</ticket>
                        <sessionid>EB6DBFAAB980DECC112B834F48703893</sessionid>
                    </startSessionReturn>
                </startSessionResponse>
            </soap:Body>
        </soap:Envelope>
        -->
    </xforms:instance>

    <xforms:instance id="alfresco-auth-headers">
        <soap:Header>
            <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                <Timestamp xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" utility:Id="">
                    <utility:Created>TO_FILL_OUT</utility:Created>
                    <utility:Expires>TO_FILL_OUT</utility:Expires>
                </Timestamp>
                <UsernameToken>
                    <Username>admin</Username>
                    <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">TO_FILL_OUT</Password>
                </UsernameToken>
            </Security>
        </soap:Header>
    </xforms:instance>

    <xforms:submission ref="instance('alfresco-auth-ws-request')" id="alfresco-auth-submission"
        method="post" action="{$alfresco-uri}api/AuthenticationService"
        xxforms:username="{$alfresco-username}" xxforms:password="{$alfresco-credentials}"
        mediatype="application/soap+xml; action="
        replace="instance" instance="alfresco-auth-ws-response">

        <xforms:action ev:event="xforms-submit">
            <!-- Fill-out credentials -->
            <xforms:setvalue ref=".//alf-auth:username" value="$alfresco-username"/>
            <xforms:setvalue ref=".//alf-auth:password" value="$alfresco-credentials"/>
        </xforms:action>

        <xforms:action ev:event="xforms-submit-done">
            <!-- Create SOAP headers for other services -->
            <xforms:setvalue ref="instance('alfresco-auth-headers')//secext:Password" value="instance('alfresco-auth-ws-response')//alf-auth:ticket"/>
            <xforms:setvalue ref="instance('alfresco-auth-headers')//utility:Created" value="current-dateTime()"/>
            <xforms:setvalue ref="instance('alfresco-auth-headers')//utility:Expires" value="current-dateTime() + xs:dayTimeDuration('PT5M')"/>
        </xforms:action>
    </xforms:submission>

    <!-- ===== Create new reference ================================================================================ -->

    <!-- Create new reference -->
    <xforms:instance id="alfresco-create-ws-request">
        <soap:Envelope>
            <!-- Headers are copied here -->
            <soap:Body>
                <update xmlns="http://www.alfresco.org/ws/service/content/1.0">
                    <statements>
                        <create xmlns="http://www.alfresco.org/ws/cml/1.0">
                            <id>1</id>
                            <parent>
                                <store>
                                    <scheme>workspace</scheme>
                                    <address>SpacesStore</address>
                                </store>
                                <!-- This is filled-out when the instance is submitted -->
                                <path/>
                                <associationType>{http://www.alfresco.org/model/content/1.0}contains</associationType>
                                <!-- This is filled-out when the instance is submitted -->
                                <childName/>
                            </parent>
                            <type>{http://www.alfresco.org/model/content/1.0}content</type>
                            <property>
                                <name>{http://www.alfresco.org/model/content/1.0}name</name>
                                <isMultiValue>false</isMultiValue>
                                <value>TO_FILL_OUT</value>
                            </property>
                            <property>
                                <name>{http://www.alfresco.org/model/content/1.0}title</name>
                                <isMultiValue>false</isMultiValue>
                                <value>TO_FILL_OUT</value>
                            </property>
                            <property>
                                <name>{http://www.alfresco.org/model/content/1.0}description</name>
                                <isMultiValue>false</isMultiValue>
                                <value>TO_FILL_OUT</value>
                            </property>
                        </create>
                    </statements>
                </update>
            </soap:Body>
        </soap:Envelope>
    </xforms:instance>

    <xforms:instance id="alfresco-create-ws-response">
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"/>
        <!-- Example response -->
        <!--
        <soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
            <soapenv:Body>
                <updateResponse xmlns="http://www.alfresco.org/ws/service/content/1.0">
                    <ns1:updateReturn xmlns:ns1="http://www.alfresco.org/ws/service/repository/1.0">
                        <ns1:statement>create</ns1:statement>
                        <ns1:updateCount xsi:nil="true"/>
                        <ns1:sourceId>1</ns1:sourceId>
                        <ns1:source xsi:nil="true"/>
                        <ns1:destination>
                            <ns2:store xmlns:ns2="http://www.alfresco.org/ws/model/content/1.0">
                                <ns2:scheme>workspace</ns2:scheme>
                                <ns2:address>SpacesStore</ns2:address>
                            </ns2:store>
                            <ns3:uuid xmlns:ns3="http://www.alfresco.org/ws/model/content/1.0">cde64201-6cfc-11dc-9c92-b378cde2d040</ns3:uuid>
                            <ns4:path xmlns:ns4="http://www.alfresco.org/ws/model/content/1.0">/app:company_home/app:guest_home/cm:form</ns4:path>
                        </ns1:destination>
                    </ns1:updateReturn>
                </updateResponse>
            </soapenv:Body>
        </soapenv:Envelope>
        -->
    </xforms:instance>

    <xforms:submission ref="instance('alfresco-create-ws-request')" id="alfresco-create-submission"
        method="post" action="{$alfresco-uri}/api/RepositoryService"
        xxforms:username="{$alfresco-username}" xxforms:password="{$alfresco-credentials}"
        mediatype="application/soap+xml; action="
        replace="instance" instance="alfresco-create-ws-response">

        <xforms:action ev:event="xforms-submit">
            <!-- Set path -->
            <xforms:setvalue ref=".//alf-cml:path" value="$alfresco-path"/>
            <!-- Set authentication headers -->
            <xforms:delete nodeset="instance('alfresco-create-ws-request')/soap:Header"/>
            <xforms:insert context="instance('alfresco-create-ws-request')" origin="instance('alfresco-auth-headers')"/>
        </xforms:action>
    </xforms:submission>

    <!-- ==== Post content ========================================================================================= -->

    <!-- Post content -->
    <xforms:instance id="alfresco-post-content-ws-request">
        <soap:Envelope>
            <!-- Headers are copied here -->
            <soap:Body>
                <write xmlns="http://www.alfresco.org/ws/service/content/1.0">
                    <node>
                        <store>
                            <scheme>workspace</scheme>
                            <address>SpacesStore</address>
                        </store>
                        <uuid>TO_FILL_OUT</uuid>
                        <!--<path>/app:company_home/app:guest_home/cm:foobar.pdf</path>-->
                    </node>
                    <property>{http://www.alfresco.org/model/content/1.0}content</property>
                    <content/>
                    <format>
                        <mimetype>TO_FILL_OUT</mimetype>
                        <!--<encoding></encoding>-->
                    </format>
                </write>
            </soap:Body>
        </soap:Envelope>
    </xforms:instance>

    <xforms:instance id="alfresco-post-content-ws-response">
        <dummy/>
    </xforms:instance>

    <xforms:submission ref="instance('alfresco-post-content-ws-request')" id="alfresco-post-content-submission"
        method="post" action="{$alfresco-uri}/api/ContentService"
        xxforms:username="{$alfresco-username}" xxforms:password="{$alfresco-credentials}"
        mediatype="application/soap+xml; action="
        replace="instance" instance="alfresco-post-content-ws-response">

        <xforms:action ev:event="xforms-submit">
            <!-- Set authentication headers -->
            <xforms:delete nodeset="instance('alfresco-post-content-ws-request')/soap:Header"/>
            <xforms:insert context="instance('alfresco-post-content-ws-request')" origin="instance('alfresco-auth-headers')"/>
        </xforms:action>
    </xforms:submission>

</xforms:model>
